IDEA StatiCa Open Model
ReinfAroundOpening.DiagonalNumOfLayers Property
Compatible with IDEA StatiCa Beta 21.0 - beta
 Number of diagonal layers
 Namespace: IdeaRS.OpenModel.Detail
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public int DiagonalNumOfLayers { get; set; }
Public Property DiagonalNumOfLayers As Integer
	Get
	Set
public:
property int DiagonalNumOfLayers {
	int get ();
	void set (int value);
}
Property Value
Type: Int32
See Also
Reference
ReinfAroundOpening Class
IdeaRS.OpenModel.Detail Namespace